//начало крамол окс 11.11.2016 18:09:20 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФормаОткрытаИзТолстогоКлиента = Параметры.Свойство("УровеньПоля", УровеньПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ФормаОткрытаИзТолстогоКлиента Тогда
		
		Если УровеньПоля = 1 ИЛИ УровеньПоля = 2 Тогда
			Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы;
		Иначе
			Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//конец крамол окс 11.11.2016 18:09:24 