
Процедура ПередЗаписью(Отказ)
	
	Если (НЕ ЭтоНовый()) 
			И (ЗначениеАналитики <> Ссылка.ЗначениеАналитики 
				ИЛИ Владелец <> Ссылка.Владелец) Тогда
				//ИЛИ ПорядокСортировкиВКлючеАналитик <> Ссылка.ПорядокСортировкиВКлючеАналитик) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК ЕстьЗаписи
			|ИЗ
			|	РегистрСведений.ЦенообразованиеСетка КАК ЦенообразованиеСетка
			|ГДЕ
			|	ЦенообразованиеСетка.АналитикаСумм = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Нельзя редактировать аналитику, по которой есть зарегистрированные цены.");
		КонецЕсли;
		
	КонецЕсли;              
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Наименование = Строка(ЗначениеАналитики); 
	
КонецПроцедуры
