
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаДобавления = ТекущаяДатаСеанса();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПредставление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СудноПриИзменении(Элемент)
	
	ЗаполнитьПредставление();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДобавленияПриИзменении(Элемент)
	
	ЗаполнитьПредставление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьПредставление()

	Если ЗначениеЗаполнено(Объект.Судно) И ЗначениеЗаполнено(Объект.ДатаДобавления) Тогда
		Объект.Наименование = СокрЛП(Объект.Судно) + " (" + Формат(Объект.ДатаДобавления, "ДФ=dd.MM.yyyy") + ")";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

