
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контрагент"			, Контрагент);
	
	ЭтаФорма.Заголовок = "История цен " + СокрЛП(Контрагент) 
							+ " по услуге " + СокрЛП(УслугаОрганизации) + " (" + СокрЛП(Принципал) + ")";
							
	ЗаполнитьПараметрыИсторииЦенУслуг();
							
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	//Если НЕ ЗначениеЗаполнено(УслугаОрганизации) Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	                    
	Элементы.ИсторияЦенУслуг.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыИсторииЦенУслуг()
	
	ИсторияЦенУслуг.Параметры.УстановитьЗначениеПараметра("Контрагент"			, Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	//Если УслугаОрганизации = ПредопределенноеЗначение("Перечисление.ТипыУслугОрганизации.ЭПИ") Тогда
	//	
	//	Элементы.ИсторияЦенУслугЦенаУслуги.Видимость 										= Ложь;
	//	Элементы.ИсторияЦенУслугЦенаЗаПервуюCMR.Видимость 									= Истина;
	//	Элементы.ИсторияЦенУслугЦенаЗаДополнительнуюCMR.Видимость 							= Истина;
	//	Элементы.ИсторияЦенУслугЦенаЗаДополнительныйКод.Видимость 							= Истина;
	//	Элементы.ИсторияЦенУслугКоличествоБесплатныхКодов.Видимость 						= Истина;
	//	
	//ИначеЕсли УслугаОрганизации = ПредопределенноеЗначение("Перечисление.ТипыУслугОрганизации.ЭТД") Тогда
	//	
	//	Элементы.ИсторияЦенУслугЦенаУслуги.Видимость 										= Ложь;
	//	Элементы.ИсторияЦенУслугЦенаЗаПервуюCMR.Видимость 									= Истина;
	//	Элементы.ИсторияЦенУслугЦенаЗаДополнительнуюCMR.Видимость 							= Истина;
	//	Элементы.ИсторияЦенУслугЦенаЗаДополнительныйКод.Видимость 							= Истина;
	//	Элементы.ИсторияЦенУслугКоличествоБесплатныхКодов.Видимость 						= Истина;
	//	
	//Иначе
		
		Элементы.ИсторияЦенУслугЦенаУслуги.Видимость 										= Истина;
		Элементы.ИсторияЦенУслугЦенаЗаПервуюCMR.Видимость 									= Истина;
		Элементы.ИсторияЦенУслугЦенаЗаДополнительнуюCMR.Видимость 							= Истина;
		Элементы.ИсторияЦенУслугЦенаЗаДополнительныйКод.Видимость 							= Истина;
		Элементы.ИсторияЦенУслугКоличествоБесплатныхКодов.Видимость 						= Истина;
		
	//КонецЕсли;
	
КонецПроцедуры


	

