
Функция ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт
  КомандаОтчет = КомандыОтчетов.Добавить();
        
  КомандаОтчет.Менеджер = Метаданные.Отчеты.ВыработкаДекларантов.ПолноеИмя();
  КомандаОтчет.Представление = НСтр("ru = 'Декларанты'");
        
  КомандаОтчет.Важность = "Обычное";
  КомандаОтчет.ДополнительныеПараметры.Вставить("ИмяКоманды", "ВыработкаДекларантов");
  КомандаОтчет.КлючВарианта = "ВыработкаДекларантов";
        
  Возврат КомандаОтчет;

КонецФункции

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВыработкаДекларантов");
	НастройкиВарианта.Описание = НСтр("ru = 'Декларанты'");  
КонецПроцедуры