
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки(); 
	
	//Можем редактировать настройки компоновки (НастройкиСКД)
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиСКД, ДанныеРасшифровки);
	//МакетКомпоновкиДанных.Макеты.Удалить(МакетКомпоновкиДанных.Макеты.Макет3);
	//МакетКомпоновкиДанных.Макеты.Удалить(МакетКомпоновкиДанных.Макеты.Макет5);
	
	//Можем редактировать итоговые наборы данных и макеты табличного документа (МакетКомпоновкиДанных)
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	//Формируем отчет поэлементно
	//Вместо стандартного вывода одним методом - ПроцессорВывода.Вывести(ПроцессорКомпоновки)
	ПроцессорВывода.НачатьВывод();
	Пока Истина Цикл
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		Если ЭлементРезультата = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		//Можем редактировать данные, внешний вид и расшифровку выводимого элемента (ЭлементРезультата)
		
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
	
	//Можем редактировать табличный документ (ДокументРезультат)
	
КонецПроцедуры	
