
Процедура ПередЗаписью(Отказ)
	
	Если (НЕ ЭтоНовый()) 
			И (ИспользоватьДополнительнуюАналитику <> Ссылка.ИспользоватьДополнительнуюАналитику 
				ИЛИ ТипДополнительнойАналитики <> Ссылка.ТипДополнительнойАналитики) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК ЕстьЗаписи
			|ИЗ
			|	РегистрСведений.ТарифныеСеткиОбеспечения КАК ЦенообразованиеСетка
			|ГДЕ
			|	ЦенообразованиеСетка.КлючАналитик = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Нельзя редактировать ключ аналитик, по которому есть зарегистрированные цены.");
		КонецЕсли;
		
	КонецЕсли;              
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ИспользоватьДополнительнуюАналитику Тогда
		ПроверяемыеРеквизиты.Добавить("ТипДополнительнойАналитики")
	КонецЕсли;
	
КонецПроцедуры
