
Процедура ПередЗаписью(Отказ)
	
	Если (НЕ ЭтоНовый()) 
			И (ЗначениеАналитики <> Ссылка.ЗначениеАналитики 
				ИЛИ Владелец <> Ссылка.Владелец) Тогда
				//ИЛИ ПорядокСортировкиВКлючеАналитик <> Ссылка.ПорядокСортировкиВКлючеАналитик) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК ЕстьЗаписи
			|ИЗ
			|	РегистрСведений.ЦенообразованиеСетка КАК ЦенообразованиеСетка
			|ГДЕ
			|	ЦенообразованиеСетка.ДополнительнаяАналитика = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Нельзя редактировать аналитику, по которой есть зарегистрированные цены.");
		КонецЕсли;
		
	КонецЕсли;              
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	пНаим = "";
	Если Владелец.ИспользоватьДополнительнуюАналитику Тогда
		Если Владелец.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.АдминистративныйОкруг Тогда
			Если ЗначениеАналитики = Неопределено Тогда
				ЗначениеАналитики = Справочники.АдминистративныеОкруги.ПустаяСсылка();
			КонецЕсли;
			Если ЗначениеАналитики = Справочники.АдминистративныеОкруги.ПустаяСсылка() Тогда
				пНаим = "<не указан>"; 
			КонецЕсли;
		ИначеЕсли Владелец.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Расстояние Тогда
			ПроверяемыеРеквизиты.Добавить("ЗначениеАналитики");
		КонецЕсли;
	КонецЕсли;

	Если пНаим = "" Тогда
		Наименование = Строка(ЗначениеАналитики);
	Иначе
		Наименование = пНаим;
	КонецЕсли;
	
КонецПроцедуры
