
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблРежимов = Объект.ДоступныеРежимыОформления.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РежимыОформления.Ссылка КАК Ссылка
		|ИЗ
		|	Перечисление.РежимыОформления КАК РежимыОформления
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	СписокРежимовОформления.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Для каждого ЭлСп Из СписокРежимовОформления Цикл
		ЭлСп.Пометка = (ТаблРежимов.Найти(ЭлСп.Значение, "РежимОформления") <> Неопределено);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьРежимовОформления();	
	УстановитьДоступностьЦеновыхГрупп();	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДоступныеРежимыОформления.Очистить();
	Для каждого ЭлСп Из СписокРежимовОформления Цикл
		Если ЭлСп.Пометка Тогда
			НовСтр = ТекущийОбъект.ДоступныеРежимыОформления.Добавить();
			НовСтр.РежимОформления = ЭлСп.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УчитыватьРежимыОформленияПриИзменении(Элемент)

	УстановитьДоступностьРежимовОформления();	
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьЦеновыеГруппыПриИзменении(Элемент)

	УстановитьДоступностьЦеновыхГрупп();	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРежимовОформленияПометкаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьВсеРежимы(Команда)
	
	СписокРежимовОформления.ЗаполнитьПометки(Истина);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеРежимы(Команда)
	
	СписокРежимовОформления.ЗаполнитьПометки(Ложь);
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьРежимовОформления()
	
	Элементы.ГруппаКоманднаяПанельСписокРежимов.Доступность = Объект.УчитыватьРежимыОформления;
	Элементы.СписокРежимовОформления.Доступность 			= Объект.УчитыватьРежимыОформления;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЦеновыхГрупп()
	
	Элементы.ЦеновыеГруппыМашин.Доступность = Объект.УчитыватьЦеновыеГруппы;
	
КонецПроцедуры

#КонецОбласти
