
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	//УстановитьДоступностьИндивидуальныйРасчет();	
	Если Запись.СпецЦены Тогда
		Элементы.ПунктОтправления.Доступность = Истина;
	Иначе
		Элементы.ПунктОтправления.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючАналитикПриИзменении(Элемент)
	
	УстановитьЗаголовки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовки()	
	
	Если ЗначениеЗаполнено(Запись.КлючАналитик) И Запись.КлючАналитик.ИспользоватьДополнительнуюАналитику Тогда
		Если Запись.КлючАналитик.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.АдминистративныйОкруг Тогда
			Элементы.ДополнительнаяАналитика.Заголовок = "Административный округ";
		ИначеЕсли Запись.КлючАналитик.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Расстояние Тогда
			Элементы.ДополнительнаяАналитика.Заголовок = "Расстояние, км";
		ИначеЕсли Запись.КлючАналитик.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.КоличествоТаможенныхПунктов Тогда
			Элементы.ДополнительнаяАналитика.Заголовок = "Кол-во таможенных пунктов";
		ИначеЕсли Запись.КлючАналитик.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Страна Тогда
			Элементы.ДополнительнаяАналитика.Заголовок = "Страна";
		Иначе 
			Элементы.ДополнительнаяАналитика.Заголовок = "Дополнительная аналитика";
		КонецЕсли;
	Иначе
		Элементы.ДополнительнаяАналитика.Заголовок = "Дополнительная аналитика";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	ТекДата 		= ТекущаяДатаСеанса();
	
	ТекущийОбъект.Ответственный = ТекПользователь;
	ТекущийОбъект.ДатаУстановки = ТекДата;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьИндивидуальныйРасчет()
	
	Элементы.Цена.Доступность 		= (НЕ Запись.ИндивидуальныйРасчет);
	Элементы.ВидРасчета.Доступность = (НЕ Запись.ИндивидуальныйРасчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ИндивидуальныйРасчетПриИзменении(Элемент)

	УстановитьДоступностьИндивидуальныйРасчет();	
	
КонецПроцедуры
