
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	пСоставГруппы = "";
	Для каждого Стр Из СтраныГруппы Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Страна) Тогда
			Продолжить;
		КонецЕсли;
		
		пСоставГруппы = пСоставГруппы + СокрЛП(Стр.Страна) + ", ";
		
	КонецЦикла;
	
	Если пСоставГруппы <> "" Тогда
		пСоставГруппы = Лев(пСоставГруппы, СтрДлина(пСоставГруппы)-2);
	КонецЕсли;
	
	//Если СтрДлина(пСоставГруппы) > 1000 Тогда
	//	пСоставГруппы = Лев(пСоставГруппы, 997) + "...";
	//КонецЕсли;
	
	Если пСоставГруппы <> СоставГруппы Тогда
		СоставГруппы = пСоставГруппы;
	КонецЕсли;
	
КонецПроцедуры
