
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Элементы.Список.РежимВыбора = (Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора);

	СписокМашинПарома.Параметры.УстановитьЗначениеПараметра("ЕстьОтборПоПарому"	, Ложь);
	СписокМашинПарома.Параметры.УстановитьЗначениеПараметра("Паром"				, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	СтрокаДС = Элементы.Список.ТекущиеДанные;
	Если СтрокаДС <> Неопределено Тогда
		СписокМашинПарома.Параметры.УстановитьЗначениеПараметра("ЕстьОтборПоПарому"	, Истина);
		СписокМашинПарома.Параметры.УстановитьЗначениеПараметра("Паром"				, СтрокаДС.Ссылка);
	Иначе
		СписокМашинПарома.Параметры.УстановитьЗначениеПараметра("ЕстьОтборПоПарому"	, Ложь);
		СписокМашинПарома.Параметры.УстановитьЗначениеПараметра("Паром"				, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы


#КонецОбласти

#Область ОбработчикиКомандФормы


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти