
Функция ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт
  КомандаОтчет = КомандыОтчетов.Добавить();

  КомандаОтчет.Менеджер = Метаданные.Отчеты.РеестрОказанныхУслуг.ПолноеИмя();
  КомандаОтчет.Представление = НСтр("ru = 'Реестр оказанных услуг'");
        
  КомандаОтчет.Важность = "Обычное";
  КомандаОтчет.ДополнительныеПараметры.Вставить("ИмяКоманды", "РеестрОказанныхУслуг");
  КомандаОтчет.КлючВарианта = "РеестрОказанныхУслуг";
        
  Возврат КомандаОтчет;

КонецФункции

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РеестрОказанныхУслуг");
	НастройкиВарианта.Описание = НСтр("ru = 'РеестрОказанныхУслуг'");  
КонецПроцедуры