
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПредварительноеИнформирование";
	КомандаПечати.Представление = "Предварительное информирование";
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;    
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПредварительноеИнформирование", "Предварительное информирование", 
	ПечатьЭлектронногоОформления(МассивОбъектов));  
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрОказанныхУслуг") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрОказанныхУслуг", "Реестр оказанных услуг", 
	//	СформироватьРеестр(МассивОбъектов));
	//КонецЕсли;
	
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция ДоступныеДляШаблоновПечатныеФормы() Экспорт
	
	МассивДоступныхПечатныхФорм = Новый Массив;
	
	Возврат МассивДоступныхПечатныхФорм

КонецФункции

#КонецОбласти 
#КонецЕсли

#Область Отчеты
//Заполняет список отчетов формы объектов
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
  Отчеты.РеестрОказанныхУслуг.ДобавитьКомандыОтчетов(КомандыОтчетов);
  Отчеты.ВыработкаДекларантов.ДобавитьКомандыОтчетов(КомандыОтчетов);
КонецПроцедуры
#КонецОбласти

Функция ПечатьЭлектронногоОформления(МассивОбъектов) Экспорт
	
	Документ = МассивОбъектов[0];
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОперацияПоПоручительству_ПредварительноеИнформирование";
	ТабДокумент.РазмерСтраницы		= "A4";
	ТабДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	
	Макет 					= ПолучитьМакет("ПредварительноеИнформирование");	
	пОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	пОбластьЗаголовок.Параметры.ТекстЗаголовка = "Предварительное информирование";
	ТабДокумент.Вывести(пОбластьЗаголовок);
	
	пВыводитьПТД 			= Ложь;
	пВыводитьДополнение 	= Ложь;
	пВыводитьЭТД 			= Ложь;
	
	//Если УслугаОрганизации = Справочники.УслугиОрганизации.ЭПИ_Гарантия_ЭТД Тогда
		пПрефиксО = "ЭПИ_Гарантия_ЭТД_ПТД";  // только с ПТД
		пВыводитьПТД 		= Истина;
		пВыводитьДополнение = Истина;
		пВыводитьЭТД 		= Истина;
	//ИначеЕсли УслугаОрганизации = Справочники.УслугиОрганизации.ЭПИ_Гарантия Тогда
	//	пПрефиксО = "ЭПИ_Гарантия";
	//	пВыводитьДополнение = Истина;
	//ИначеЕсли УслугаОрганизации = Справочники.УслугиОрганизации.ЭПИ_ЭТД Тогда
	//	пПрефиксО = "ЭПИ_ЭТД";
	//	пВыводитьЭТД 		= Истина;
	//Иначе//Если УслугаОрганизации = Справочники.УслугиОрганизации.ЭПИ Тогда
		//пПрефиксО = "ЭПИ";  
	//КонецЕсли;
	//
	пОблШТЧ = "ШапкаТаблицы" + пПрефиксО;
	пОблСТЧ = "СтрокаТаблицы" + пПрефиксО;
	пОблПТЧ = "ПодвалТаблицы" + пПрефиксО;
	//
	пОбластьШапка		 	= Макет.ПолучитьОбласть("Шапка"); 
	пОбластьШапка.Параметры.ОсновноеТС 				= СокрЛП(Документ.ОсновноеТС);
	пОбластьШапка.Параметры.ДополнительноеТС 		= СокрЛП(Документ.ДополнительноеТС);
	пОбластьШапка.Параметры.ПунктОтправления 		= СокрЛП(Документ.ПунктОтправления);
	пОбластьШапка.Параметры.ПунктНазначения	 		= СокрЛП(Документ.ПунктНазначения);
	//
	пОбластьШапка.Параметры.КодПунктаОтправления 	= СокрЛП(Документ.ПунктОтправления.КодПункта);
	пОбластьШапка.Параметры.КодПунктаНазначения 	= СокрЛП(Документ.ПунктНазначения.КодПункта);
	//
	//Если (УслугаОрганизации = Справочники.УслугиОрганизации.ЭПИ_TIR И СтранаОформления = Справочники.СтранаОформления.Беларусь)
	//		ИЛИ (УслугаОрганизации = Справочники.УслугиОрганизации.ЭПИ И СтранаОформления = Справочники.СтранаОформления.Россия) Тогда
	//	Если ЗначениеЗаполнено(КоличествоКодов) Тогда
			пОбластьШапка.Параметры.ВсегоКодовНазвание 	= "Всего кодов:";
			пОбластьШапка.Параметры.ВсегоКодов 			= Формат(Документ.КодыCMR.Итог("КоличествоКодов"), "ЧН=0");
	//	КонецЕсли;
	//КонецЕсли;
	//Если пВыводитьДополнение И СтранаОформления = Справочники.СтранаОформления.Россия Тогда
		пОбластьШапка.Параметры.РасстояниеНазвание 	= "Расстояние, км:";
		пОбластьШапка.Параметры.Расстояние 			= Формат(Окр(Документ.Расстояние, 0), "ЧДЦ=0");
	//КонецЕсли;
	//
	//ТекстПраво = "";
	//Если пВыводитьДополнение Тогда
	//	Если НЕ Контрагент.НеПоказыватьСуммыВПисьмахОтветах Тогда
			пОбластьШапка.Параметры.СуммаОбеспеченияНазвание 	= "Сумма обеспечения, " + СокрЛП(Документ.ВалютаОбеспечения) + ":";
			пОбластьШапка.Параметры.СуммаОбеспечения 			= Формат(Документ.СуммаОбеспечения, "ЧДЦ=2");
	//	КонецЕсли;
	//КонецЕсли;
	//Если НЕ Контрагент.НеПоказыватьЦеныВПисьмахОтветах Тогда
		пОбластьШапка.Параметры.СуммаКОплатеНазвание 	= "Сумма к оплате : ";
		пОбластьШапка.Параметры.СуммаКОплате 			= Формат(Документ.Оплата, "ЧДЦ=2");
	//КонецЕсли;
	//
	ТабДокумент.Вывести(пОбластьШапка);
	//
	пОбластьШапкаТЧ	= Макет.ПолучитьОбласть(пОблШТЧ);
	ТабДокумент.Вывести(пОбластьШапкаТЧ);

	пЗаполнятьЦену 	= Ложь;
	СтрПИ 			= Неопределено;
	СтрДополнение 	= Неопределено;
	СтрУИН			= Неопределено;
	СуммаДопУслуг	= 0;
	Если пВыводитьПТД Тогда //расчет цены в каждой CMR
		пЗаполнятьЦену = Истина;
		Если Документ.СуммаОбеспечения = 0
				ИЛИ Документ.КодыCMR.Итог("Цена") <> Документ.СуммаОбеспечения Тогда
			пЗаполнятьЦену = Ложь;
		Иначе
			МасСтрСНезаполненнойЦеной = Документ.КодыCMR.НайтиСтроки(Новый Структура("Цена", 0));
			Если МасСтрСНезаполненнойЦеной.Количество() > 0 Тогда
				пЗаполнятьЦену = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Если пЗаполнятьЦену Тогда
	//	МасСтрПИ = ОплатыУслуг.НайтиСтроки(Новый Структура("Услуга", Перечисления.ТипыУслугОрганизации.ЭПИ));
	//	Если МасСтрПИ.Количество() > 0 Тогда
	//		СтрПИ = МасСтрПИ[0];
	//	КонецЕсли;
	//	МасСтрДополнение = ОплатыУслуг.НайтиСтроки(Новый Структура("Услуга", Перечисления.ТипыУслугОрганизации.ЭПИГарантия));
	//	Если МасСтрДополнение.Количество() > 0 Тогда
	//		СтрДополнение = МасСтрДополнение[0];
	//	КонецЕсли;
	//	МасСтрУИН = ОплатыУслуг.НайтиСтроки(Новый Структура("Услуга", Перечисления.ТипыУслугОрганизации.ЭТД));
	//	Если МасСтрУИН.Количество() > 0 Тогда
	//		СтрУИН = МасСтрУИН[0];
	//	КонецЕсли;
	//	СуммаДопУслуг = ДополнительныеУслуги.Итог("Сумма");
	//КонецЕсли;
	//
	пОбластьСтрокаТЧ		= Макет.ПолучитьОбласть(пОблСТЧ);
	//
	пИтогЦУ = 0;
	КвоCMR 	= Документ.КодыCMR.Количество();
	Для Инд = 1 По КвоCMR Цикл
		СтрТЧ = Документ.КодыCMR[Инд-1];
		
		пОбластьСтрокаТЧ.Параметры.НомерCMR 			= СокрЛП(СтрТЧ.НомерCMR);
		//пОбластьСтрокаТЧ.Параметры.ЭПИ 					= СокрЛП(СтрТЧ.ЭПИ);
		Если пВыводитьПТД Тогда
			пОбластьСтрокаТЧ.Параметры.ПТД 				= СокрЛП(СтрТЧ.ПТД);
			Если пЗаполнятьЦену Тогда
				Если Инд = КвоCMR Тогда
					пЦУ = Документ.Оплата - пИтогЦУ;
				Иначе
					пЦУ = 0;
					Если СтрПИ <> Неопределено Тогда
						ппЦ = СтрПИ.Сумма - СтрПИ.СуммаКодов;
						Если ппЦ > 0 Тогда
							пЦУ = пЦУ + (СтрПИ.Сумма / КвоCMR);
						КонецЕсли;
						
						Если СтрПИ.СуммаКодов > 0 И СтрПИ.КоличествоКодов > 0 Тогда
							пКодов = СтрТЧ.КоличествоКодов - СтрПИ.КоличествоБесплатныхКодовВCMR;
							Если пКодов > 0 Тогда
							   	пЦУ = пЦУ + (СтрПИ.СуммаКодов * пКодов / СтрПИ.КоличествоКодов);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					Если СтрУИН <> Неопределено Тогда
						ппЦ = СтрУИН.Сумма - СтрУИН.СуммаКодов;
						Если ппЦ > 0 Тогда
							пЦУ = пЦУ + (СтрУИН.Сумма / КвоCMR);
						КонецЕсли;
						
						Если СтрУИН.СуммаКодов > 0 И СтрУИН.КоличествоКодов > 0 Тогда
							пКодов = СтрТЧ.КоличествоКодов - СтрУИН.КоличествоБесплатныхКодовВCMR;
							Если пКодов > 0 Тогда
							   	пЦУ = пЦУ + (СтрУИН.СуммаКодов * пКодов / СтрУИН.КоличествоКодов);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					Если СтрДополнение <> Неопределено Тогда
						Если СтрДополнение.Сумма > 0 Тогда
							 пЦУ = пЦУ + (СтрДополнение.Сумма * СтрТЧ.Цена / Документ.СуммаОбеспечения);
						КонецЕсли;
					КонецЕсли;
					Если СуммаДопУслуг > 0 Тогда
						пЦУ = пЦУ + (СуммаДопУслуг / КвоCMR);
					КонецЕсли;
					Если пЦУ > 0 Тогда
						пЦУ = Окр(пЦУ, 0);
					КонецЕсли;
					
					пИтогЦУ = пИтогЦУ + пЦУ;
				КонецЕсли;
				
				пОбластьСтрокаТЧ.Параметры.Цена 		= Формат(пЦУ, "ЧДЦ=2");
			КонецЕсли;
		КонецЕсли;
		Если пВыводитьДополнение Тогда
			пОбластьСтрокаТЧ.Параметры.НомерДополнения 	= СокрЛП(СтрТЧ.НомерДополнения);
		КонецЕсли;
		Если пВыводитьЭТД Тогда
			пОбластьСтрокаТЧ.Параметры.ЭТД 				= СокрЛП(СтрТЧ.ЭТД);
		КонецЕсли;
		пОбластьСтрокаТЧ.Параметры.КоличествоКодов 		= Формат(СтрТЧ.КоличествоКодов, "ЧГ=0");
		
		ТабДокумент.Вывести(пОбластьСтрокаТЧ);
		
	КонецЦикла;
	//
	ТабДокумент.ПолеСверху	= 0;
	ТабДокумент.ПолеСнизу	= 0;
	ТабДокумент.ПолеСлева	= 0;
	ТабДокумент.ПолеСправа	= 0;
	ТабДокумент.АвтоМасштаб = Истина;
	
	пОбластьПодвалТЧ		= Макет.ПолучитьОбласть(пОблПТЧ);
	ТабДокумент.Вывести(пОбластьПодвалТЧ);
	
	Возврат ТабДокумент;
	
КонецФункции







