
&НаСервере
Процедура СкопироватьСАналитикамиНаСервере(ТекКлюч)
	
	НовКлюч = ТекКлюч.Скопировать();
	НовКлюч.Наименование = СокрЛП(ТекКлюч.Наименование) + " копия";
	
	Попытка
		НовКлюч.Записать();
	Исключение
	    ОбщегоНазначения.СообщитьПользователю("Не удалось записать ключ аналитик: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АналитикиСуммЦенообразования.Ссылка
		|ИЗ
		|	Справочник.АналитикиСуммЦенообразования КАК АналитикиСуммЦенообразования
		|ГДЕ
		|	АналитикиСуммЦенообразования.Владелец = &ТекКлюч
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДополнительныеАналитикиЦенообразования.Ссылка
		|ИЗ
		|	Справочник.ДополнительныеАналитикиЦенообразования КАК ДополнительныеАналитикиЦенообразования
		|ГДЕ
		|	ДополнительныеАналитикиЦенообразования.Владелец = &ТекКлюч";
	
	Запрос.УстановитьПараметр("ТекКлюч", ТекКлюч);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекАналитика = Выборка.Ссылка;
		НовАналитика = ТекАналитика.Скопировать();
		НовАналитика.Владелец = НовКлюч.Ссылка;
		
		Попытка
			НовАналитика.Записать();
		Исключение
		    ОбщегоНазначения.СообщитьПользователю("Не удалось записать аналитику " + СокрЛП(ТекАналитика) + ": " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСАналитиками(Команда)
	
	СтрокаДС = Элементы.Список.ТекущиеДанные;
	Если СтрокаДС <> Неопределено Тогда
		СкопироватьСАналитикамиНаСервере(СтрокаДС.Ссылка);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	Если ИмяСобытия = "СеткаИзменена" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры
