
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		ЭтаФорма.ТолькоПросмотр = (НЕ ДоработкиОбщегоНазначенияПривилегированный.РазрешеноРедактированиеТаможенныхПунктов());

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	
	СтруктураДанных = ПриИзмененииСтраныНаСервере(Объект.Страна);
	
	Объект.ИндексПоискаПоКодуСтраны = СтруктураДанных.МеждународныйКод;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриИзмененииСтраныНаСервере(пСтрана)
	
	Возврат Новый Структура("МеждународныйКод", пСтрана.МеждународныйКод);
	
КонецФункции
