
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контрагент"				, Контрагент);
	Параметры.Свойство("Принципал"				, Принципал);
	Параметры.Свойство("УслугаОрганизации"		, УслугаОрганизации);
	Параметры.Свойство("СтранаНачалаТранзита"	, ГруппаСтранНачалаТранзита);
	Параметры.Свойство("ГруппаКодовУКТЗЕД"		, ГруппаКодовУКТЗЕД);
	Параметры.Свойство("СпецЦены"				, СпецЦены);
	Параметры.Свойство("СубконтоСпецЦены"		, Объект.СубконтоСпецЦены);
	
	ЗаполнитьТабличныйДокументНаСервере();
	
	ЭтаФорма.Заголовок = "История цен " + СокрЛП(Контрагент) 
							+ " по услуге " + СокрЛП(УслугаОрганизации) + " (" + СокрЛП(Принципал) + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	                    
	ЗаполнитьТабличныйДокументНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументНаСервере()

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Контрагент"			, Контрагент);
	СтруктураПараметров.Вставить("Принципал"			, Принципал);
	СтруктураПараметров.Вставить("УслугаОрганизации"	, УслугаОрганизации);
	СтруктураПараметров.Вставить("СтранаНачалаТранзита"	, ГруппаСтранНачалаТранзита);
	СтруктураПараметров.Вставить("ГруппаКодовУКТЗЕД"	, ГруппаКодовУКТЗЕД);
	СтруктураПараметров.Вставить("СпецЦены"				, СпецЦены);
	СтруктураПараметров.Вставить("ТипУслуги"			, ТипУслуги);
	СтруктураПараметров.Вставить("СубконтоСпецЦены"		, Объект.СубконтоСпецЦены);

	ПолучитьТабличныйДокументИсторииЦен(СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТабличныйДокументИсторииЦен(СтруктураПараметров)
	
	ТабличныйДокументИсторииЦен.Очистить();
	
	СписокАктуальныхПериодов = ПолучитьСписокПериодов();

	Если СписокПериодов.Количество() = 0 Тогда
		СписокПериодов = СписокАктуальныхПериодов;
		Инд = 1;
		Для каждого ЭлСп Из СписокПериодов Цикл
			Если Инд > 3 Тогда
				Прервать;
			КонецЕсли;
			ЭлСп.Пометка = Истина;
			Инд = Инд + 1;
		КонецЦикла;
	Иначе
		пСписокП = СписокПериодов.Скопировать();
		СписокПериодов.Очистить();
		Для каждого ЭлСп Из СписокАктуальныхПериодов Цикл
			НовЭл = СписокПериодов.Добавить(ЭлСп.Значение, ЭлСп.Представление);
			СтЭл = пСписокП.НайтиПоЗначению(НовЭл.Значение);
			Если СтЭл <> Неопределено Тогда
				НовЭл.Пометка = СтЭл.Пометка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Макет 			= РегистрыСведений.ТарифныеСеткиОбеспечения.ПолучитьМакет("МакетСеткиЦен");
	ОблПустаяСтрока = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
	КодЯзыка 		= "ru";
	
	Для каждого Эл Из СписокПериодов Цикл
		Если НЕ Эл.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗаголовка = НСтр("ru='Дата цен: '", КодЯзыка) + Формат(Эл.Значение, "ДФ=dd.MM.yyyy") + НСтр("ru=' г.'", КодЯзыка);
		
		ТабличныйДокументИсторииЦен.Вывести(РегистрыСведений.ТарифныеСеткиОбеспечения.ТабличныйДокументЦенВывод(СтруктураПараметров,, КодЯзыка, ТекстЗаголовка, Эл.Значение));
		ТабличныйДокументИсторииЦен.Вывести(ОблПустаяСтрока);
	КонецЦикла;
	
КонецПроцедуры                      
	
&НаСервере
Функция ПолучитьСписокПериодов()
	
	СписокАктуальныхПериодов = Новый СписокЗначений;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЦенообразованиеСетка.Период КАК Период
			|ИЗ
			|	РегистрСведений.ТарифныеСеткиОбеспечения КАК ЦенообразованиеСетка
			|ГДЕ
			|	ЦенообразованиеСетка.Контрагент = &Контрагент
			|	И ЦенообразованиеСетка.СпецЦены = &СпецЦены
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
		
		Запрос.УстановитьПараметр("Контрагент"					, Контрагент);
		Запрос.УстановитьПараметр("СпецЦены"					, СпецЦены);
		
	
	СписокАктуальныхПериодов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Период"));
	
	Возврат СписокАктуальныхПериодов;

КонецФункции

	

