
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем МассивСтран;
	Перем МассивУслуг;
	
	СОтборомПоСтранам = Параметры.Свойство("МассивСтран"				, МассивСтран);
	
	Список.Параметры.УстановитьЗначениеПараметра("СОтборомПоСтранам"	, СОтборомПоСтранам);
	Список.Параметры.УстановитьЗначениеПараметра("СписокСтран"			, МассивСтран);
	
	СОтборомПоТипамУслуг = Параметры.Свойство("МассивУслуг"				, МассивУслуг);
	
	Список.Параметры.УстановитьЗначениеПараметра("СОтборомПоТипамУслуг"	, СОтборомПоТипамУслуг);
	Список.Параметры.УстановитьЗначениеПараметра("СписокУслуг"			, МассивУслуг);
	
КонецПроцедуры
