
Перем мПоследняяДатаОбновленияРассмотренностиПисем Экспорт;

// Переменная содержит список доступных учетных для создания писем
Перем мДоступныеУчетныеЗаписи Экспорт;

// Переменная содержит структуру с данными о доступе пользователя к ученым записям
// и о предопределенных папках учетных записей
Перем мСтруктураДоступныхУчетныхЗаписей Экспорт;

// Переменная содержит соответствие учетной записи и предопределенной
// группы писем "Входящие" для учетной записи
Перем мСоответствияГруппВходящие Экспорт;

// Переменная содержит соответствие учетной записи и предопределенной
// группы писем "Исходящие" для учетной записи
Перем мСоответствияГруппИсходящие Экспорт;

// Переменная содержит соответствие учетной записи и предопределенной
// группы писем "Удаленные" для учетной записи
Перем мСоответствияГруппУдаленные Экспорт;

// Переменная содержит соответствие учетной записи и предопределенной
// группы писем "Черновики" для учетной записи
Перем мСоответствияГруппЧерновики Экспорт;

// Переменная содержит соответствие группы писем электронной почты
// и количества нерассмотренных писем в этой группе
Перем мСтатистикаРассмотренностиПисем Экспорт;

// Переменная содержит соответствие группы писем электронной почты
// и количества сохраненных писем в этой группе
Перем мСтатистикаСохраненныхПисем     Экспорт;

// Переменная содержит соответствие предмета классификации писем
// и количества нерассмотренных писем данного предмета
Перем мСтатистикаРассмотренностиПисемПоПредметам Экспорт;

// Признак отображения списка предметов электронных писем в форме
Перем мОтображатьСписокПредметов Экспорт;

#Если Клиент Тогда	

// Процедура обновляет данные доступных учетных записей текущего пользователя
// а так же данные о предопределенных группах учетных записей.
//
Процедура ОбновитьДоступныеУчетныеЗаписи() Экспорт

	мСоответствияГруппИсходящие.Очистить();
	мСоответствияГруппВходящие.Очистить();
	мСоответствияГруппУдаленные.Очистить();
	мСоответствияГруппЧерновики.Очистить();
	
	мСтруктураДоступныхУчетныхЗаписей = УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписи(глЗначениеПеременной("глТекущийПользователь"));
	
	мДоступныеУчетныеЗаписи = мСтруктураДоступныхУчетныхЗаписей.Чтение.Скопировать();
	
	мСоответствияГруппИсходящие = мСтруктураДоступныхУчетныхЗаписей.ГруппыИсходящие;
	мСоответствияГруппВходящие  = мСтруктураДоступныхУчетныхЗаписей.ГруппыВходящие;
	мСоответствияГруппУдаленные = мСтруктураДоступныхУчетныхЗаписей.ГруппыУдаленные;
	мСоответствияГруппЧерновики = мСтруктураДоступныхУчетныхЗаписей.ГруппыЧерновики;
	
КонецПроцедуры

// Процедура определяет статистику рассмотренности писем электронной почты
// для быстрого отображения их количества в дереве групп писем электронной почты
// и в списке предметов писем.
//
Процедура СобратьСтатистикуРассмотренностиПисем() Экспорт

	мСтатистикаРассмотренностиПисем.Очистить();
	мСтатистикаСохраненныхПисем.Очистить();
	мСтатистикаРассмотренностиПисемПоПредметам.Очистить();
	
	Если ПравоДоступа("Чтение", Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты) Тогда
	
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("СписокУчетныхЗаписей", мДоступныеУчетныеЗаписи);
		Запрос.УстановитьПараметр("ТекущаяДата"         , ТекущаяДата());
		
		мПоследняяДатаОбновленияРассмотренностиПисем = ТекущаяДата();
		
		Если мОтображатьСписокПредметов Тогда
		
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПисьмаЭлектроннойПочтыОстатки.ГруппаУчетнойЗаписи                   КАК Группа,
			|	ПисьмаЭлектроннойПочтыОстатки.Предмет                               КАК Предмет,
			|	СУММА(ПисьмаЭлектроннойПочтыОстатки.КоличествоНеРассмотреноОстаток) КАК Количество,
			|	СУММА(0)                                                            КАК КоличествоЧерновики
			|ИЗ
			|	РегистрНакопления.ПисьмаЭлектроннойПочты.Остатки КАК ПисьмаЭлектроннойПочтыОстатки
			|
			|ГДЕ
			|	ПисьмаЭлектроннойПочтыОстатки.ГруппаУчетнойЗаписи.Владелец В(&СписокУчетныхЗаписей)
			|	И
			|	ПисьмаЭлектроннойПочтыОстатки.ГраницаПрочитанности < &ТекущаяДата
			|
			|СГРУППИРОВАТЬ ПО
			|	ПисьмаЭлектроннойПочтыОстатки.ГруппаУчетнойЗаписи, ПисьмаЭлектроннойПочтыОстатки.Предмет
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПисьмаЭлектроннойПочтыОстатки.ГруппаУчетнойЗаписи                   КАК Группа,
			|	ПисьмаЭлектроннойПочтыОстатки.Предмет                               КАК Предмет,
			|	СУММА(0)                                                            КАК Количество,
			|	СУММА(ПисьмаЭлектроннойПочтыОстатки.КоличествоЧерновикиОстаток)     КАК КоличествоЧерновики
			|ИЗ
			|	РегистрНакопления.ПисьмаЭлектроннойПочты.Остатки КАК ПисьмаЭлектроннойПочтыОстатки
			|
			|ГДЕ
			|	ПисьмаЭлектроннойПочтыОстатки.ГруппаУчетнойЗаписи.Владелец В(&СписокУчетныхЗаписей)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПисьмаЭлектроннойПочтыОстатки.ГруппаУчетнойЗаписи, ПисьмаЭлектроннойПочтыОстатки.Предмет
			|
			|ИТОГИ СУММА(Количество),СУММА(КоличествоЧерновики) ПО
			|	Группа
			|";
			
			ВыборкаГрупп = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Группа");
			Пока ВыборкаГрупп.Следующий() Цикл
				мСтатистикаРассмотренностиПисем.Вставить(ВыборкаГрупп.Группа, ВыборкаГрупп.Количество);
				мСтатистикаСохраненныхПисем.Вставить(ВыборкаГрупп.Группа, ВыборкаГрупп.КоличествоЧерновики);
				ВыборкаПредметов = ВыборкаГрупп.Выбрать();
				СоответствиеГруппаПредмет = Новый Соответствие;
				Пока ВыборкаПредметов.Следующий() Цикл
					СоответствиеГруппаПредмет.Вставить(ВыборкаПредметов.Предмет, ВыборкаПредметов.Количество);
				КонецЦикла; 
				Если СоответствиеГруппаПредмет.Количество() > 0 Тогда
					мСтатистикаРассмотренностиПисемПоПредметам.Вставить(ВыборкаГрупп.Группа, СоответствиеГруппаПредмет);
				КонецЕсли; 
			КонецЦикла;

		Иначе
		
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПисьмаЭлектроннойПочтыОстатки.ГруппаУчетнойЗаписи            КАК Группа,
			|	ПисьмаЭлектроннойПочтыОстатки.КоличествоНеРассмотреноОстаток КАК Количество,
			|	0                                                            КАК КоличествоЧерновики
			|ИЗ
			|	РегистрНакопления.ПисьмаЭлектроннойПочты.Остатки КАК ПисьмаЭлектроннойПочтыОстатки
			|
			|ГДЕ
			|	ПисьмаЭлектроннойПочтыОстатки.ГруппаУчетнойЗаписи.Владелец В(&СписокУчетныхЗаписей)
			|	И
			|	ПисьмаЭлектроннойПочтыОстатки.ГраницаПрочитанности < &ТекущаяДата
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПисьмаЭлектроннойПочтыОстатки.ГруппаУчетнойЗаписи        КАК Группа,
			|	0                                                        КАК Количество,
			|	ПисьмаЭлектроннойПочтыОстатки.КоличествоЧерновикиОстаток КАК КоличествоЧерновики
			|ИЗ
			|	РегистрНакопления.ПисьмаЭлектроннойПочты.Остатки КАК ПисьмаЭлектроннойПочтыОстатки
			|
			|ГДЕ
			|	ПисьмаЭлектроннойПочтыОстатки.ГруппаУчетнойЗаписи.Владелец В(&СписокУчетныхЗаписей)
			|
			|ИТОГИ СУММА(Количество),СУММА(КоличествоЧерновики) ПО
			|	Группа
			|";
			
			Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Группа");
			Пока Выборка.Следующий() Цикл
				мСтатистикаРассмотренностиПисем.Вставить(Выборка.Группа, Выборка.Количество);
				мСтатистикаСохраненныхПисем.Вставить(Выборка.Группа, Выборка.КоличествоЧерновики);
			КонецЦикла;

		КонецЕсли;
	
	Иначе
		
		Сообщить(НСтр("ru='У Вас закрыт доступ к таблицам, обслуживающим электронную почту.';uk='У Вас закритий доступ до таблиць, що обслуговують електронну пошту.'"));
		Возврат;
		
	КонецЕсли;

КонецПроцедуры
//		//СерияДокумента	= "";
//////Процедура СоздатьОпрос(ТекущийПредмет) Экспорт
//////	
//////	ЗапросПоПредмету = Новый Запрос;
//////	ЗапросПоПредмету.УстановитьПараметр("Предмет", ТекущийПредмет);
//////	ЗапросПоПредмету.УстановитьПараметр("Отправленное", Перечисления.СтатусыПисем.Отправленное);
//////	ЗапросПоПредмету.УстановитьПараметр("Полученное", Перечисления.СтатусыПисем.Полученное);
//////	ЗапросПоПредмету.Текст = "ВЫБРАТЬ
//////							 |	ПредметыЭлектронныхПисем.Регистратор КАК ЭП,
//////							 |	ВЫБОР КОГДА ВложенияЭлектронныхПисем.ИмяФайла ПОДОБНО ""%.rps"" ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЕстьРезультатОпроса,
//////							 |	ВЫБОР КОГДА ВложенияЭлектронныхПисем.ИмяФайла ПОДОБНО ""%.rps"" ТОГДА ВложенияЭлектронныхПисем.Хранилище КОНЕЦ КАК Хранилище,
//////							 |	ПредметыЭлектронныхПисем.Регистратор.КомуТЧ.(
//////							 |		ВЫБОР КОГДА ПредметыЭлектронныхПисем.Регистратор.СтатусПисьма = &Отправленное ТОГДА ПредметыЭлектронныхПисем.Регистратор.КомуТЧ.АдресЭлектроннойПочты ИНАЧЕ """" КОНЕЦ КАК АдресКому
//////							 |	) КАК Кому,
//////							 |	ВЫБОР КОГДА ПредметыЭлектронныхПисем.Регистратор.СтатусПисьма = &Полученное ТОГДА ПредметыЭлектронныхПисем.Регистратор.ОтправительАдресЭлектроннойПочты ИНАЧЕ """" КОНЕЦ КАК АдресОтКого
//////							 |ИЗ
//////							 |	РегистрСведений.ПредметыЭлектронныхПисем КАК ПредметыЭлектронныхПисем
//////							 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВложенияЭлектронныхПисем КАК ВложенияЭлектронныхПисем
//////							 |		ПО ПредметыЭлектронныхПисем.Регистратор = ВложенияЭлектронныхПисем.Объект
//////							 |
//////							 |ГДЕ
//////							 |	ПредметыЭлектронныхПисем.Предмет = &Предмет И
//////							 |	(ВложенияЭлектронныхПисем.ИДФайлаПочтовогоПисьма = """") И
//////							 |	(ВложенияЭлектронныхПисем.Объект.Ссылка ССЫЛКА Документ.ЭлектронноеПисьмо)";
//////	РезультатЗапроса = ЗапросПоПредмету.Выполнить();
//////	ВыборкаЗапроса 	 = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
//////	ОбработкаРезультатовАнкетирования = Обработки.ЗагрузкаРезультатовАнкетирования.Создать();
//////	
//////	Пока ВыборкаЗапроса.Следующий() Цикл
//////		Если ВыборкаЗапроса.ЕстьРезультатОпроса тогда
//////			ХранилищеИзЗапроса = ВыборкаЗапроса.Хранилище.Получить();
//////			//Попытка
//////				ИмяВрФайла = ПолучитьИмяВременногоФайла();
//////				ХранилищеИзЗапроса.Записать(ИмяВрФайла);
//////				Файл = Новый ЧтениеXML();
//////				Файл.ОткрытьФайл(ИмяВрФайла);
//////				ОбъектЗагрузки 	= ОбработкаРезультатовАнкетирования.НайтиОбъектДляЗагрузки(Файл);
//////				Анкета 			= ОбработкаРезультатовАнкетирования.ПолучитьАнкетуИзФайла(Файл);
//////				ДатаОпроса 		= ОбработкаРезультатовАнкетирования.ПолучитьДатуФормированияАнкеты(Файл);
//////				Если Анкета = Неопределено тогда
//////					Продолжить;
//////				КонецЕсли;
//////				Если ОбъектЗагрузки = Неопределено тогда
//////					// если объект загрузки найти по ИдОпрашиваемого найти не удалось, тогда пробуем его найти
//////					// по ФИО и дате рождения, если это физлицо(конт. лицо), либо по ИНН, если это контрагент
//////					Файл.ОткрытьФайл(ИмяВрФайла);
//////					ОбъектЗагрузки = ОбработкаРезультатовАнкетирования.НайтиОбъектПоАнкетнымДанным(Файл, Анкета);
//////				КонецЕсли;
//////				ДокОпрос = ОбработкаРезультатовАнкетирования.НайтиДокументОпрос(ДатаОпроса, Анкета);
//////				Если НЕ ЗначениеЗаполнено(ОбъектЗагрузки) тогда
//////					ОбъектЗагрузки = ОбработкаРезультатовАнкетирования.НайтиОбъектПоАнкетнымДанным(Файл, Анкета);
//////				КонецЕсли;
//////				Если ЗначениеЗаполнено(ДокОпрос) тогда
//////					Ответ = Вопрос(НСтр("ru='Найден документ опрос по данной анкете. Возможно такой документ уже есть в ИБ. Продолжить зарузку данных?';uk='Знайдено документ опитування по даній анкеті. Можливо такий документ уже є в ІБ. Продовжити завантаження даних?'"), РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Нет);
//////					Если Ответ = КодВозвратаДиалога.Нет тогда
//////						ФормаОЗ = ДокОпрос.ПолучитьФорму("ФормаДокумента");
//////						ФормаОЗ.Открыть();
//////						Сообщить(НСтр("ru='Найден документ опрос по данной анкете.';uk='Знайдено документ опитування по даній анкеті.'"));
//////						Возврат;
//////					ИначеЕсли Ответ = КодВозвратаДиалога.Отмена тогда
//////						Возврат;
//////					КонецЕсли;
//////				КонецЕсли;
//////				
//////				Файл.ОткрытьФайл(ИмяВрФайла);
//////				ДокРассылки 		= ОбработкаРезультатовАнкетирования.ПолучитьДокРассылкиИзФайла(Файл);
//////				Если НЕ ЗначениеЗаполнено(Анкета) тогда
//////					Продолжить;
//////				КонецЕсли;
//////				// загружаем в документ Опрос
//////				ДокОпроса = Документы.Опрос.СоздатьДокумент();
//////				
//////				Пока Файл.Прочитать() Цикл
//////					Если (Файл.ТипУзла  = ТипУзлаXML.НачалоЭлемента) и ((Файл.Имя = "Вопрос")) Тогда
//////						Значение 		= Файл.ПолучитьАтрибут("Ид");
//////						Если Значение 	= "" Тогда
//////							Файл.Прочитать();
//////							Продолжить; // Пустые вопросы пропускаем
//////						КонецЕсли;
//////						ОбработкаРезультатовАнкетирования.ПрочитатьВопрос(Файл, ДокОпроса);
//////					КонецЕсли;
//////				КонецЦикла;
//////				Файл.Закрыть();
//////				
//////				ДокОпроса.ОпрашиваемоеЛицо = ОбъектЗагрузки;
//////				ДокОпроса.Ответственный    = глЗначениеПеременной("глТекущийПользователь");
//////				ДокОпроса.ТиповаяАнкета	   = Анкета;
//////				ДокОпроса.Рассылка 		   = ДокРассылки;
//////				ДокОпроса.Дата			   = ДатаОпроса;
//////				ДокОпроса.ПолучитьФорму("ФормаДокумента").ОткрытьМодально();
//////				ОбработкаПрерыванияПользователя();
//////				
//////			//Исключение
//////			//	Сообщить("При загрузке файла " + ИмяВрФайла + " произошла ошибка");
//////			//КонецПопытки;
//////		КонецЕсли;
//////	КонецЦикла;
//////КонецПроцедуры

// Воссатновим сохраненное значение отображения списка предметов
СохраненноеЗначениеКнопки = ВосстановитьЗначение("ПометкаКнопкиОтображенияСпискаПредметов");
Если ТипЗнч(СохраненноеЗначениеКнопки) = Тип("Булево") Тогда
	мОтображатьСписокПредметов = СохраненноеЗначениеКнопки;
Иначе
	мОтображатьСписокПредметов = Ложь;
КонецЕсли;

// Инициализируем переменные объекта
мСоответствияГруппВходящие  = Новый Соответствие;
мСоответствияГруппИсходящие = Новый Соответствие;
мСоответствияГруппУдаленные = Новый Соответствие;
мСоответствияГруппЧерновики = Новый Соответствие;

мСтатистикаРассмотренностиПисем            = Новый Соответствие;
мСтатистикаСохраненныхПисем                = Новый Соответствие;
мСтатистикаРассмотренностиПисемПоПредметам = Новый Соответствие;

ОбновитьДоступныеУчетныеЗаписи();
СобратьСтатистикуРассмотренностиПисем();

#КонецЕсли	
