
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЭлементЗначениеАналитикиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Владелец.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Владелец);

КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	УстановитьЭлементЗначениеАналитикиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлементЗначениеАналитикиНаСервере()
	
	Элементы.ЗначениеАналитики.АвтоОтметкаНезаполненного = Истина;
	Если ЗначениеЗаполнено(Объект.Владелец) И Объект.Владелец.ИспользоватьДополнительнуюАналитику Тогда
		Если Объект.Владелец.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.АдминистративныйОкруг Тогда
			Элементы.ЗначениеАналитики.Заголовок = "Административный округ";
			Элементы.ЗначениеАналитики.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.АдминистративныеОкруги");
			Элементы.ЗначениеАналитики.АвтоОтметкаНезаполненного = Ложь;
		ИначеЕсли Объект.Владелец.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Расстояние Тогда
			Элементы.ЗначениеАналитики.Заголовок = "Расстояние, км";
			Элементы.ЗначениеАналитики.ОграничениеТипа = Новый ОписаниеТипов("Число");
		ИначеЕсли Объект.Владелец.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Страна Тогда
			Элементы.ЗначениеАналитики.Заголовок = "Страна";
			Элементы.ЗначениеАналитики.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтранаОформления");
		ИначеЕсли Объект.Владелец.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.КоличествоТаможенныхПунктов Тогда
			Элементы.ЗначениеАналитики.Заголовок = "Кол-во таможенных пунктов";
			Элементы.ЗначениеАналитики.ОграничениеТипа = Новый ОписаниеТипов("Число");
		Иначе 
			Элементы.ЗначениеАналитики.Заголовок = "Значение аналитики";
			Элементы.ЗначениеАналитики.ОграничениеТипа = Неопределено;
		КонецЕсли;
	Иначе
		Элементы.ЗначениеАналитики.Заголовок = "Значение аналитики";
		Элементы.ЗначениеАналитики.ОграничениеТипа = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
