
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ ПометкаУдаления Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ ПЕРВЫЕ 1
	//		//|	ГруппыКодовУКТЗЕДСписокКодов.Код КАК КодУКТЗЕД,
	//		|	ГруппыКодовУКТЗЕДСписокКодов.Код.Код КАК Код,
	//		|	ГруппыКодовУКТЗЕДСписокКодов.Ссылка КАК Ссылка
	//		|ИЗ
	//		|	Справочник.ГруппыКодовУКТЗЕД.СписокКодов КАК ГруппыКодовУКТЗЕДСписокКодов
	//		|ГДЕ
	//		|	ГруппыКодовУКТЗЕДСписокКодов.Ссылка <> &Ссылка
	//		|	И ГруппыКодовУКТЗЕДСписокКодов.Код <> ЗНАЧЕНИЕ(Справочник.КлассификаторУКТВЭД.ПустаяСсылка)
	//		|	И ГруппыКодовУКТЗЕДСписокКодов.Код В(&МассивКодов)
	//		|	И НЕ ГруппыКодовУКТЗЕДСписокКодов.Ссылка.ПометкаУдаления";
	//	
	//	Запрос.УстановитьПараметр("МассивКодов", СписокКодов.Выгрузить().ВыгрузитьКолонку("Код"));
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//			
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		Сообщить("Код УКТЗЕД " + СокрЛП(Выборка.Код) + " уже используется в группе кодов " + СокрЛП(Выборка.Ссылка));
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	пСоставГруппы = "";
	Для каждого Стр Из СписокКодов Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Код) Тогда
			Продолжить;
		КонецЕсли;
		
		пСоставГруппы = пСоставГруппы + СокрЛП(Стр.Код.Код) + ", ";
		
	КонецЦикла;
	
	Если пСоставГруппы <> "" Тогда
		пСоставГруппы = Лев(пСоставГруппы, СтрДлина(пСоставГруппы)-2);
	КонецЕсли;
	
	//Если СтрДлина(пСоставГруппы) > 1000 Тогда
	//	пСоставГруппы = Лев(пСоставГруппы, 997) + "...";
	//КонецЕсли;
	
	Если пСоставГруппы <> СоставГруппы Тогда
		СоставГруппы = пСоставГруппы;
	КонецЕсли;
	
	
	пРежимыОфомленияСтрокой = "";
	Если УчитыватьРежимыОформления Тогда
		Для каждого СтрРО Из ДоступныеРежимыОформления Цикл
			
			пРежимыОфомленияСтрокой = пРежимыОфомленияСтрокой + СокрЛП(СтрРО.РежимОформления) + ", ";
			
		КонецЦикла;
		
		Если пРежимыОфомленияСтрокой <> "" Тогда
			пРежимыОфомленияСтрокой = Лев(пРежимыОфомленияСтрокой, СтрДлина(пРежимыОфомленияСтрокой)-2);
		КонецЕсли;
	КонецЕсли;
	
	Если пРежимыОфомленияСтрокой <> РежимыОфомленияСтрокой Тогда
		РежимыОфомленияСтрокой = пРежимыОфомленияСтрокой;
	КонецЕсли;
	
	
	пЦеновыеГруппыСтрокой = "";
	Если УчитыватьЦеновыеГруппы Тогда
		Для каждого СтрЦ Из ЦеновыеГруппыМашин Цикл
			
			пЦеновыеГруппыСтрокой = пЦеновыеГруппыСтрокой + СокрЛП(СтрЦ.ЦеноваяГруппаМашины) + ", ";
			
		КонецЦикла;
		
		Если пЦеновыеГруппыСтрокой <> "" Тогда
			пЦеновыеГруппыСтрокой = Лев(пЦеновыеГруппыСтрокой, СтрДлина(пЦеновыеГруппыСтрокой)-2);
		КонецЕсли;
	КонецЕсли;
	
	Если пЦеновыеГруппыСтрокой <> ЦеновыеГруппыСтрокой Тогда
		ЦеновыеГруппыСтрокой = пЦеновыеГруппыСтрокой;
	КонецЕсли;
	
КонецПроцедуры
