
// Доработка START {Добавить поле ТипУчета на форму контрагента} {2026-04-03}
&После("ПриСозданииНаСервере")
Процедура Расш1_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)

	ИмяФормы = Форма.ИмяФормы;

	Если СтрНайти(ИмяФормы, "Справочник.Контрагенты") > 0
		И СтрНайти(ИмяФормы, "ФормаЭлемента") > 0 Тогда

		Если Форма.Элементы.Найти("Расш1_ТипУчета") <> Неопределено Тогда
			Возврат;
		КонецЕсли;

		Попытка
			Родитель = Форма.Элементы.Найти("СтраницаОсновное");

			НовоеПоле = Форма.Элементы.Добавить("Расш1_ТипУчета", Тип("ПолеФормы"), Родитель);
			НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
			НовоеПоле.ПутьКДанным = "Объект.ТипУчета";
			НовоеПоле.Заголовок = "Тип учёта";
		Исключение
			ЗаписьЖурналаРегистрации("РусскийТранзит.ТипУчета",
				УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;

	КонецЕсли;

КонецПроцедуры
// Доработка END
