
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контрагент"			, Контрагент);
	Параметры.Свойство("Принципал"			, Принципал);
	Параметры.Свойство("УслугаОрганизации"	, УслугаОрганизации);
	
	ЭтаФорма.Заголовок = "История цен " + СокрЛП(Контрагент) 
							+ " по дополнительной услуге " + СокрЛП(УслугаОрганизации) + " (" + СокрЛП(Принципал) + ")";
							
	ЗаполнитьПараметрыИсторииЦенУслуг();
							
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если НЕ ЗначениеЗаполнено(УслугаОрганизации) Тогда
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	                    
	Элементы.ИсторияЦенУслуг.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыИсторииЦенУслуг()
	
	ИсторияЦенУслуг.Параметры.УстановитьЗначениеПараметра("Контрагент"			, Контрагент);
	ИсторияЦенУслуг.Параметры.УстановитьЗначениеПараметра("Принципал"			, Принципал);
	ИсторияЦенУслуг.Параметры.УстановитьЗначениеПараметра("УслугаОрганизации"	, УслугаОрганизации);
	
КонецПроцедуры


	

