
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Параметры.Свойство("Контрагент", Контрагент);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическогоЗапросаНаСервере()
	
	Список.Параметры.УстановитьЗначениеПараметра("СОтборомПоКонтрагенту"	, ЗначениеЗаполнено(Контрагент));
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент"				, Контрагент);
	
	СЗ = Новый Массив;
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов2);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов3);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов4);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов5);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов6);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов7);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов8);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов9);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов10);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов11);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов12);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов13);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов14);
	СЗ.Добавить(Справочники.ВидыКонтактнойИнформации.ЭлектронныйАдресДляОтветов15);
	
	Список.Параметры.УстановитьЗначениеПараметра("СЗВидовДляОтветов"		, СЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыДинамическогоЗапросаНаСервере();
КонецПроцедуры
