
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность(); 
	Объект.ИспользоватьДополнительнуюАналитику = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("СеткаИзменена", Объект.Ссылка);
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	пЭтоНовый = Объект.Ссылка.Пустая();
	
	Элементы.НадписьПодсказка.Видимость						= пЭтоНовый;
	Элементы.СтраницаДополнительнаяАналитика.Видимость 		= Объект.ИспользоватьДополнительнуюАналитику;
	
	Элементы.ТипДополнительнойАналитики.Доступность 		= Объект.ИспользоватьДополнительнуюАналитику;
	Элементы.ТипДополнительнойАналитики.АвтоОтметкаНезаполненного = Объект.ИспользоватьДополнительнуюАналитику;
	
	Элементы.СтраницаСуммОбеспечения.Доступность 			= (НЕ пЭтоНовый);
	Элементы.СтраницаДополнительнаяАналитика.Доступность 	= (НЕ пЭтоНовый);
	
	УстановитьЗаголовкиЗначенийДопАналитик();
	
	СсылкаНаОбъект = Объект.Ссылка;

	//СписокСуммОбеспечения
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокСуммОбеспечения.Отбор,
		"Владелец",
		СсылкаНаОбъект,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина
	);

	//СписокДополнительныхАналитик
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокДополнительныхАналитик.Отбор,
		"Владелец",
		СсылкаНаОбъект,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина
	);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиЗначенийДопАналитик()
	
	Если Объект.ТипДополнительнойАналитики = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхАналитикЦенообразования.АдминистративныйОкруг") Тогда
		Элементы.СписокДополнительныхАналитикЗначениеАналитики.Заголовок = "Административный округ";
	ИначеЕсли Объект.ТипДополнительнойАналитики = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхАналитикЦенообразования.Расстояние") Тогда
		Элементы.СписокДополнительныхАналитикЗначениеАналитики.Заголовок = "Расстояние, км";
	ИначеЕсли Объект.ТипДополнительнойАналитики = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхАналитикЦенообразования.КоличествоТаможенныхПунктов") Тогда
		Элементы.СписокДополнительныхАналитикЗначениеАналитики.Заголовок = "Кол-во таможенных пунктов";
	ИначеЕсли Объект.ТипДополнительнойАналитики = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхАналитикЦенообразования.Страна") Тогда
		Элементы.СписокДополнительныхАналитикЗначениеАналитики.Заголовок = "Страна";
	Иначе 
		Элементы.СписокДополнительныхАналитикЗначениеАналитики.Заголовок = "Значение аналитики";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДополнительнойАналитикиПриИзменении(Элемент)
	
	УстановитьЗаголовкиЗначенийДопАналитик();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДополнительнуюАналитикуПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСуммОбеспеченияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокДополнительныхАналитикПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Модифицированность Тогда
		Отказ = Истина;
		
		пОповещение = Новый ОписаниеОповещения("ПослеВопросаОМодифицированности", ЭтаФорма, Копирование);
		ПоказатьВопрос(пОповещение,
						"Перед добавлением аналитик ключ аналитик необходимо записать. Продолжить?",
						РежимДиалогаВопрос.ДаНет);
	КонецЕсли;                                   
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОМодифицированности(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Записать() Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Владелец", Объект.Ссылка));
			Если ДополнительныеПараметры Тогда
				СтрокаДС = Элементы.СписокДополнительныхАналитик.ТекущиеДанные;
				Если СтрокаДС <> Неопределено Тогда
					ТекЭлемент = СтрокаДС.Ссылка;
					Если ЗначениеЗаполнено(ТекЭлемент) Тогда
						ПараметрыФормы.Вставить("ЗначениеКопирования", ТекЭлемент);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ОткрытьФорму("Справочник.ДополнительныеАналитикиЦенообразования.Форма.ФормаЭлементаУпр", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

